namespace SeedPatientsApp
{
	public static class StaticData
	{
		public static string[] RussianLastNames =
		[
			"Иванов", "Петров", "Сидоров", "Кузнецов", "Попов",
			"Васильев", "Михайлов", "Федоров", "Соколов", "Яковлев",
			"Павлов", "Александров", "Лебедев", "Морозов", "Романов",
			"Волков", "Ершов", "Никитин", "Соболев", "Рябов",
			"Поляков", "Цветков", "Данилов", "Жуков", "Фролов",
			"Журавлев", "Николаев", "Крылов", "Максимов", "Сидоренко",
			"Осипов", "Белоусов", "Федотов", "Дорофеев", "Егоров",
			"Матвеев", "Бобров", "Дмитриев", "Калинин", "Анисимов",
			"Петухов", "Антонов", "Тимофеев", "Никифоров", "Веселов",
			"Филиппов", "Марков", "Большаков", "Суханов", "Миронов",
			"Ширяев", "Алексеев", "Коновалов", "Шестаков", "Казаков",
			"Ефимов", "Денисов", "Громов", "Фомин", "Давыдов",
			"Мельников", "Щербаков", "Блинов", "Колесников", "Карпов",
			"Афанасьев", "Власов", "Маслов", "Исаков", "Тихонов",
			"Аксёнов", "Гаврилов", "Родионов", "Котов", "Горбунов",
			"Кудрявцев", "Быков", "Зуев", "Третьяков", "Савельев",
			"Панов", "Рыбаков", "Суворов", "Абрамов", "Воронов",
			"Иванова", "Петрова", "Сидорова", "Кузнецова", "Попова",
			"Васильева", "Михайлова", "Федорова", "Соколова", "Яковлева",
			"Павлова", "Александрова", "Лебедева", "Морозова", "Романова",
			"Волкова", "Ершова", "Никитина", "Соболева", "Рябова",
			"Полякова", "Цветкова", "Данилова", "Жукова", "Фролова",
			"Журавлева", "Николаева", "Крылова", "Максимова", "Сидоренко",
			"Осипова", "Белоусова", "Федотова", "Дорофеева", "Егорова",
			"Матвеева", "Боброва", "Дмитриева", "Калинина", "Анисимова",
			"Петухова", "Антонова", "Тимофеева", "Никифорова", "Веселова",
			"Филиппова", "Маркова", "Большакова", "Суханова", "Миронова",
			"Ширяева", "Алексеева", "Коновалова", "Шестакова", "Казакова",
			"Ефимова", "Денисова", "Громова", "Фомина", "Давыдова",
			"Мельникова", "Щербакова", "Блинова", "Колесникова", "Карпова",
			"Афанасьева", "Власова", "Маслова", "Исакова", "Тихонова",
			"Аксёнова", "Гаврилова", "Родионова", "Котова", "Горбунова",
			"Кудрявцева", "Быкова", "Зуева", "Третьякова", "Савельева",
			"Панова", "Рыбакова", "Суворова", "Абрамова", "Воронова"
		];

		public static string[] SlavicNames =
		[
			"Мирослав", // Miroslav - Bulgarian
			"Светлана", // Svetlana - Russian
			"Branka",   // Branka - Serbian
			"Václav",   // Václav - Czech
			"Bolesław", // Bolesław - Polish
			"Nataša",   // Nataša - Slovenian
			"Ljubica",  // Ljubica - Croatian
			"Radoslav", // Radoslav - Slovak
			"Драган",   // Dragan - Macedonian
			"Володимир", // Volodymyr - Ukrainian
			"Барыс",    // Barys - Belarusian
			"Goran",    // Goran - Montenegrin
			"Zoran",    // Zoran - Bosnian
			"Ivana",    // Ivana - Czech
			"Katarina", // Katarina - Slovak
			"Milena",   // Milena - Bulgarian
			"Никола",   // Nikola - Serbian
			"Олена",    // Olena - Ukrainian
			"Petar",    // Petar - Croatian
			"Radmila"   // Radmila - Macedonian
		];
	}
}
